<?php

$userKeyboard = json_encode([
    'keyboard' => [
        [['text' => '💎 شروع کسب درآمد 💎']],
        [['text' => '🏠 حساب کاربری'], ['text' => '🌟 برترین کاربران']],
        [['text' => '💸 برداشت از حساب'], ['text' => '📊 تاریخچه برداشت']],
        [['text' => '📚 راهنما'], ['text' => '📞 پشتیبانی'], ['text' => '📜 قوانین']]
    ]
]);

$adminKeyboard = json_encode([
    'keyboard' => [
        [['text' => '📊 آمار ربات']],
        [['text' => '✏️ متن بنر'], ['text' => '📷 عکس بنر']],
        [['text' => '🔘 توضیحات کسب درآمد']],
        [['text' => '🚫 مسدود کردن کاربر'], ['text' => '✅ رفع مسدود کاربر']],
        [['text' => '🔍 جستجوی کاربر']],
        [['text' => '📢 ارسال همگانی'], ['text' => '📤 فروارد همگانی']],
        [['text' => '🎁 تنظیم هدیه دعوت'], ['text' => '💰 تنظیم حداقل برداشت']],
        [['text' => '✏️ تنظیم متن شروع'], ['text' => '📜 تنظیم متن قوانین']],
        [['text' => '🧑‍💻 تنظیم متن پشتیبانی'], ['text' => '📚 تنظیم متن راهنما']],
        [['text' => '➕ افزودن جوین اجباری'], ['text' => '➖ حذف جوین اجباری']],
        [['text' => '🔧 تنظیم کانال برداشت‌ ها'],['text' => '👀 کانال اثبات واریز']],
        [['text' => '🔙 بازگشت به منو اصلی']]
    ]
]);

$backToAdminKeyboard =  json_encode([
    'keyboard' => [
        [['text' => '🔙 بازگشت به مدیریت']]
    ]
]);

$backToUserKeyboard =  json_encode([
    'keyboard' => [
        [['text' => '🔙 بازگشت به منو اصلی']]
    ]
]);
